In [23]:
%load_ext sql

%sql postgresql://ahmad:passw0rd@localhost:5432/northwind
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [24]:
from IPython.core.display import display, HTML

display(HTML("<style>.dataframe {width: 100%;}</style>"))

/tmp/ipykernel_103465/2583356205.py:1: DeprecationWarning: Importing display from IPython.core.display is deprecated since IPython 7.14, please import from IPython.display
  from IPython.core.display import display, HTML

# inventory_status_summary

In [25]:
%%sql

SELECT
    CASE 
        WHEN units_in_stock < reorder_level THEN 'Below Reorder Level'
        WHEN units_in_stock = reorder_level THEN 'At Reorder Level'
        ELSE 'Above Reorder Level'
    END AS inventory_status,
    COUNT(*) AS product_count
FROM
    "northwind"."dwh"."fact_inventory"
GROUP BY
    inventory_status
ORDER BY
    product_count DESC

 * postgresql://ahmad:***@localhost:5432/northwind
3 rows affected.

[('Above Reorder Level', 55),
 ('Below Reorder Level', 18),
 ('At Reorder Level', 4)]

# monthly_products_rank

In [26]:

%%sql

WITH orders AS (
    SELECT
        order_date,
        unit_price,
        quantity,
        discount,
        CASE 
            WHEN discount = 0 THEN unit_price * quantity
            ELSE unit_price * quantity * discount
        END AS total
    FROM
        "northwind"."dwh"."fact_orders"
    WHERE shipped_date IS NOT NULL
)
,
transformed AS (
    SELECT
        EXTRACT(MONTH FROM order_date) as month,
        EXTRACT(YEAR FROM order_date) as year,
        ROUND(SUM(total), 2) as total
    FROM
        orders
    GROUP BY
        EXTRACT(MONTH FROM order_date)
        , EXTRACT(YEAR FROM order_date)
    ORDER BY
        EXTRACT(YEAR FROM order_date)
		, EXTRACT(MONTH FROM order_date)
)
SELECT * FROM transformed

 * postgresql://ahmad:***@localhost:5432/northwind
23 rows affected.

[(Decimal('7'), Decimal('1996'), Decimal('5464.50')),
 (Decimal('8'), Decimal('1996'), Decimal('8655.68')),
 (Decimal('9'), Decimal('1996'), Decimal('6448.30')),
 (Decimal('10'), Decimal('1996'), Decimal('4854.18')),
 (Decimal('11'), Decimal('1996'), Decimal('3393.02')),
 (Decimal('12'), Decimal('1996'), Decimal('11435.35')),
 (Decimal('1'), Decimal('1997'), Decimal('11302.77')),
 (Decimal('2'), Decimal('1997'), Decimal('5798.07')),
 (Decimal('3'), Decimal('1997'), Decimal('18341.05')),
 (Decimal('4'), Decimal('1997'), Decimal('9345.24')),
 (Decimal('5'), Decimal('1997'), Decimal('2369.68')),
 (Decimal('6'), Decimal('1997'), Decimal('6465.85')),
 (Decimal('7'), Decimal('1997'), Decimal('23136.50')),
 (Decimal('8'), Decimal('1997'), Decimal('17035.88')),
 (Decimal('9'), Decimal('1997'), Decimal('15411.09')),
 (Decimal('10'), Decimal('1997'), Decimal('22435.29')),
 (Decimal('11'), Decimal('1997'), Decimal('15106.00')),
 (Decimal('12'), Decimal('1997'), Decimal('9447.42')),
 (Decimal('1'), Decimal('1998'), Decimal('19496.57')),
 (Decimal('2'), Decimal('1998'), Decimal('23374.82')),
 (Decimal('3'), Decimal('1998'), Decimal('41281.14')),
 (Decimal('4'), Decimal('1998'), Decimal('28009.14')),
 (Decimal('5'), Decimal('1998'), Decimal('2123.95'))]

# monthly_sales_summary

In [28]:
%%sql

WITH orders AS (
    SELECT
        order_date,
        unit_price,
        quantity,
        discount,
        (unit_price * quantity * discount) AS total
    FROM
        "northwind"."dwh"."fact_orders"
    WHERE shipped_date IS NOT NULL
)
,
transformed AS (
    SELECT
        EXTRACT(MONTH FROM order_date) as month,
        EXTRACT(YEAR FROM order_date) as year,
        ROUND(SUM(total), 2) as total
    FROM
        orders
    GROUP BY
        EXTRACT(MONTH FROM order_date)
        , EXTRACT(YEAR FROM order_date)
    ORDER BY
        EXTRACT(YEAR FROM order_date)
		, EXTRACT(MONTH FROM order_date)
)
SELECT * FROM transformed

 * postgresql://ahmad:***@localhost:5432/northwind
23 rows affected.

[(Decimal('7'), Decimal('1996'), Decimal('335.00')),
 (Decimal('8'), Decimal('1996'), Decimal('160.28')),
 (Decimal('9'), Decimal('1996'), Decimal('648.40')),
 (Decimal('10'), Decimal('1996'), Decimal('1968.08')),
 (Decimal('11'), Decimal('1996'), Decimal('978.22')),
 (Decimal('12'), Decimal('1996'), Decimal('4683.15')),
 (Decimal('1'), Decimal('1997'), Decimal('3633.77')),
 (Decimal('2'), Decimal('1997'), Decimal('1504.67')),
 (Decimal('3'), Decimal('1997'), Decimal('417.35')),
 (Decimal('4'), Decimal('1997'), Decimal('175.40')),
 (Decimal('5'), Decimal('1997'), Decimal('485.78')),
 (Decimal('6'), Decimal('1997'), Decimal('1166.90')),
 (Decimal('7'), Decimal('1997'), Decimal('1335.42')),
 (Decimal('8'), Decimal('1997'), Decimal('359.39')),
 (Decimal('9'), Decimal('1997'), Decimal('604.89')),
 (Decimal('10'), Decimal('1997'), Decimal('2308.04')),
 (Decimal('11'), Decimal('1997'), Decimal('984.90')),
 (Decimal('12'), Decimal('1997'), Decimal('1445.72')),
 (Decimal('1'), Decimal('1998'), Decimal('3304.27')),
 (Decimal('2'), Decimal('1998'), Decimal('846.77')),
 (Decimal('3'), Decimal('1998'), Decimal('2417.59')),
 (Decimal('4'), Decimal('1998'), Decimal('4861.89')),
 (Decimal('5'), Decimal('1998'), Decimal('391.90'))]

# yearly_sales_summary

In [29]:
%%sql
WITH orders AS (
    SELECT
        order_date,
        unit_price,
        quantity,
        discount,
        (unit_price * quantity * discount) AS total
    FROM
        "northwind"."dwh"."fact_orders"
    WHERE shipped_date IS NOT NULL
)
,
transformed AS (
    SELECT
        EXTRACT(YEAR FROM order_date) as year,
        ROUND(SUM(total), 2) as total
    FROM
        orders
    GROUP BY
        EXTRACT(YEAR FROM order_date)
    ORDER BY
        EXTRACT(YEAR FROM order_date)
)
SELECT * FROM transformed

 * postgresql://ahmad:***@localhost:5432/northwind
3 rows affected.

[(Decimal('1996'), Decimal('8773.13')),
 (Decimal('1997'), Decimal('14422.21')),
 (Decimal('1998'), Decimal('11822.42'))]